/* Errors returned by the device in the form of xml */
"Success" = "Success";
"TestInProgress" = "Testing is in progress... Please wait.";
"ErrorDeviceBusy" = "The device is busy. Please try again later.";
"ErrorDuplicateDisplayName" = "Duplicate display or location name. Please assign a different name and try again.";
"ErrorEmptyEntry" = "One of the entries in the settings sent to the device is empty. Please check if all entries are valid and try again.";
"ErrorListFull" = "There is no space available to add this entry. Please delete an entry from the device and try again.";
"ErrorSettingNotTested" = "This setting has not been tested.";
"ErrorSystemFailure" = "A critical failure as occurred. Please try again later.";
"ErrorNoMoreSpace" = "The maximum email attachment size is too big for the selected server. Please enter a lower value and try again.";
"ErrorNoWritePermission" = "The folder you have selected does not have write permission. Please set the proper access rights to the folder and try again.";
"ErrorConnectionFailed" = "The device cannot connect to the remote server you have specified. Please verify the server settings.";
"ErrorConnectionRefused" = "The server refused the connection. Please check that the server is on and functioning.";
"ErrorServerNotFound" = "The device cannot resolve the server's hostname. Please verify the server settings.";
"ErrorWrongCredentials" = "The server rejected the user credentials used for authentication. Please enter correct credentials and try again.";
"ErrorConnectionProblem" = "There was a problem connecting to the remote server. Please check if the server is connected to the network and functioning.";
"ErrorProtocolNotSupported" = "Remote server uses a protocol that is not supported.";
"ErrorInvalidFileOrDirectory" = "The path that you have specified is invalid. Please specify a valid path and try again.";
"ErrorInvalidFolderPath" = "The path that you have specified is invalid. Please specify a valid path and try again.";
"ErrorInvalidShare" = "The shared folder is invalid. Please select a different shared folder and try again.";
"ErrorAuthenticationNeeded" = "The specified server requires authentication. Please enter correct credentials to access the server and try again.";
"ErrorSecureConnectionNotSupported" = "The server does not support secure connection. Clear the Use SSL checkbox and try again.";
"ErrorSenderInvalid" = "The sender email address is invalid. Please enter a valid sender email address and try again.";
"ErrorRecipientInvalid" = "The recipient email address is invalid. Please enter a valid recipient email address and try again.";
"ErrorServerError" = "The server returned an error. The requested operation cannot be completed. Please check if the server details that you have entered are correct.";
"ErrorInvalidServerName" = "The server specified is invalid. Please enter a valid SMTP server and try again.";

"404 Not Found" = "The device cannot be found. Please check if the device is connected to the network and turned on.";
"400 Bad Request" = "The request cannot be processed due to an error in the request. Please try again later.";

//error if the seed URL could not be obtained from the device
"COULD_NOT_GET_ACTUAL_URL" = "The device did not return a valid URL. Please wait for a few minutes and try again.";

/* XML Data validation errors */
"Setting Error" = "Missing or Invalid Data Error";
"MISSING_FOLDER_SETTING" = "Some folder destination details are missing. Please select a folder, enter user name and password, then try again.";
"MISSING_EMAIL_SETTING" = "Some Email destination details are missing. Please enter all the email setting, then try again.";
"MISSING_SERVER_CREDENTIALS" = "The server credentials are missing. Please enter user name and password, then try again.";
"MISSING_DISPLAY_NAME" = "The Sender name is missing. Please enter a Sender name, then try again.";
"MISSING_EMAIL_ADDRESS" = "The email address is missing. Please enter a valid email address, then try again.";
"MISSING_SERVER" = "The server is missing. Please enter a server, then try again.";

"INVALID_PIN" = "The Personal Identification Number that you have entered is invalid. The number should be exactly 4 digits. Please enter a valid PIN and try again.";
"INVALID_SERVER_PORT" = "The server port number you have entered is invalid. The port number should be between 1 and 65535.";
"INVALID_ATTMT_SIZE" = "The maximum attachment size you have entered is invalid. The number should be between 1 and 9999. Specify -1 for automatic attachment size setting.";
"INVALID_DFADESTINATION" = "The Digital Fax Destination you have selected is invalid. Please select a correct destination.";
"INVALID_POLLING_TIME" = "The Polling Interval that you have selected is invalid. Valid values are 5, 10, 15, 20, 30, 45 and 60. Please select a proper interval and try again.";
"INVALID_DISPLAY_NAME" = "The Sender name that you have entered is invalid. Please enter a Sender name that is less than 25 characters.";

/* Buttons */
"OK" = "OK";
"Cancel" = "Cancel";
"Hide" = "Hide";

/* Other errors */
"GENERIC_ERROR_TITLE" = "Error";
"GENERIC_DEVICE_ERROR_TITLE" = "Device Error";
"GENERIC_DEVICE_ERROR_DESC" = "An unknown error has occurred when communicating with the device. Please try again later.";
"XML_PARSING_ERROR" = "The device returned invalid data. Wait a few minutes, then try again.";
"DEVICE_COMMUNICATION_ERROR_DESC" = "There was an error communicating with the device. Please check that the device and your machine are connected to the network and try again.";

/*vhm: Added PML Related Errors*/

"DEVICE_NOT_FOUND_TITLE" = "Device Not Found";
"DEVICE_NOT_FOUND_DESC" = "There was a problem communicating with the device. Make sure the device is powered on and properly connected then try again.";

"PML_ERROR_TITLE" = "Device Error";
"PML_ERROR_DESC1" = "There was a problem setting the information to the device. Please make sure that the input values are valid.";

"SETTING_REJECTED_TITLE" = "Settings Not Accepted";
"SETTING_REJECTED_DESCRIPTION" = "Setup could not be performed because the device is protected by an administrative password. Please use the Embedded Web Server to remove the administrative password. Refer to your device documentation for more information";

"GENERAL_DATA_MISSING_DESCRIPTION" = "One or more fields do not contain any data. Please complete all fields or click Cancel.";


//Device Door open error while printing the fax logs
"DOOR_OPEN_TITLE" = "Door/Cover is open";
"DOOR_OPEN_DESC" = "The printer cannot print because a cover is open. Please close all covers on the printer.";


//Device not ready error while printing the fax logs
"INCORRECT_STATE_TITLE" = "Printer is in an error state";
"INCORRECT_STATE_DESC" = "Please resolve the error condition for the device and try again.";

//Device busy error while printing the fax logs
"DEVICE_BUSY_TITLE" = "Printer is currently busy";
"DEVICE_BUSY_DESC" = "Please wait while the printer finishes its current job.";

//Error if the device's region code does not support fax blocking
"CALLER_ID_NOT_SUPPORTED_TITLE" = "Caller ID Not Supported";
"CALLER_ID_NOT_SUPPORTED_DESC" = "The Country/Region currently set in your device does not support Caller ID. Please use the device’s front panel to select a Country/Region that supports Caller ID and try again.";

//Error if black list entries are applied while device is processing the fax job
"COULD_NOT_APPLY_SETTINGS_TITLE" = "Could not apply settings.";
"COULD_NOT_APPLY_SETTINGS_DESC" = "Check if the device is online and connected, and is not processing a fax job.";


